#### UnitFormatUtils Members

---

|  |
| --- |
| UnitFormatUtils Class   Methods   See Also |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Format(Units, ForgeTypeId, Double, Boolean) | Formats a number with units into a string. |
| Public method Static member | Format(Units, ForgeTypeId, Double, Boolean, FormatValueOptions) | Formats a number with units into a string. |
| Public method Static member | TryParse(Units, ForgeTypeId, String, Double ) | Parses a formatted string into a number with units if possible. |
| Public method Static member | TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double ) | Parses a formatted string into a number with units if possible. |
| Public method Static member | TryParse(Units, ForgeTypeId, String, Double , String ) | Parses a formatted string into a number with units if possible. |
| Public method Static member | TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double , String ) | Parses a formatted string into a number with units if possible. |

# See Also

UnitFormatUtils Class

Autodesk.Revit.DB Namespace